In [32]:
#import libraries

import mysql.connector
from mysql.connector import Error
import pandas as pd

In [33]:
#function to create server connection
def server_conn(host_name,user_name,user_password):
    connection = None
    try:
        connection = mysql.connector.connect(host=host_name, 
                                             user=user_name, 
                                             passwd=user_password)
        print('Database Connection Established')
    except Error as err:
        print("Error-",err)
    return connection

connection = server_conn("localhost","root","725@Mysql")
print(connection)

Database Connection Established
<mysql.connector.connection.MySQLConnection object at 0x7f81f9284610>

In [3]:
#function to create a database
def create_db(connection,query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database Created Successfully")
    except:
        print("Error-",err)
        
database_create_query = "Create database db2"
create_db(connection,database_create_query)

NameError: name 'err' is not defined

In [34]:
#Connection to database
def db_connection(host_name,user_name,user_password , db_name):
    connection = None
    try:
        connection = mysql.connector.connect(host=host_name, 
                                             user=user_name, 
                                             passwd=user_password,
                                             database=db_name)
        print('Database Connection Established')
    except Error as err:
        print("Error-",err)
    return connection

In [35]:
#function to execute sql querries

def execute_query(connection,query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Querry Executed")
    except Error as err:
        print("Error-",err)

In [36]:
#create a table to maintain product order history
create_employee = """
create table emp_details(
e_id int primary key, 
e_name varchar(35) , 
e_salary INTEGER(6),
e_age int,
e_gender varchar(35),
e_dept varchar(25));
"""

#database connection
connection = db_connection("localhost","root","725@Mysql", "db2")
execute_query(connection,create_employee)

Database Connection Established
Error- 1050 (42S01): Table 'emp_details' already exists

In [37]:
#Insert data into the table

emp_info = """
insert into emp_details values
(1, 'John', 95000, 45, 'Male', 'Operations'),

(2, 'Jerry', 80000, 22, 'Male', 'Support'),

(3, 'Anne', 120000, 25, 'Female', 'Analytics'),

(4, 'Jerry', 72000, 30, 'Female', 'Analytics'),

(5, 'Bipul', 150000, 33, 'Male', 'Sales'),

(6, 'Samuel', 112000, 28, 'Male', 'Operations');
"""

connection = db_connection("localhost","root","725@Mysql", "db2")
execute_query(connection,emp_info)

Database Connection Established
Error- 1062 (23000): Duplicate entry '1' for key 'emp_details.PRIMARY'

In [38]:
#Read the data table

def read_table(connection,query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print("Error-",err)

In [39]:
#execute read function

read_query = "select * from emp_details"
connection = db_connection("localhost","root","725@Mysql", "db2")
results = read_table(connection,read_query)
for res in results:
    print(res)

Database Connection Established
(1, 'John', 95000, 45, 'Male', 'Operations')
(2, 'Jerry', 80000, 22, 'Male', 'Support')
(3, 'Anne', 120000, 25, 'Female', 'Analytics')
(4, 'Jerry', 72000, 30, 'Female', 'Analytics')
(5, 'Bipul', 150000, 33, 'Male', 'Sales')
(6, 'Samuel', 112000, 28, 'Male', 'Operations')

**Types of Function**
 * Basic Function
 * String Function
 * Case Function
 * IF Function
 * User-Defined Function

# Basic functions

**MIN() - gives Smallest value**

In [40]:
min_age = "select min(e_age) from emp_details;"
connection = db_connection("localhost","root","725@Mysql", "db2")

result = read_table(connection,min_age)
for res in result:
    print(res)

Database Connection Established
(22,)

**MAX() - gives largest value**

In [41]:
max_age = "select max(e_age) from emp_details;"
connection = db_connection("localhost","root","725@Mysql", "db2")

result = read_table(connection,max_age)
for res in result:
    print(res)

Database Connection Established
(45,)

In [42]:
max_salary = "select max(e_salary) from emp_details;"
connection = db_connection("localhost","root","725@Mysql", "db2")

result = read_table(connection,max_salary)
for res in result:
    print(res)

Database Connection Established
(150000,)

**count() - returns number of rows that match specific criteria**

In [43]:
count_male = "select count(*) from emp_details where e_gender='Male';"
connection = db_connection("localhost","root","725@Mysql", "db2")

result = read_table(connection,count_male)
for res in result:
    print(res)

Database Connection Established
(4,)

In [44]:
count_male = "select count(*) from emp_details where e_gender='Female';"
connection = db_connection("localhost","root","725@Mysql", "db2")

result = read_table(connection,count_male)
for res in result:
    print(res)

Database Connection Established
(2,)

**SUM() - returns total sum of a numeric column**

In [45]:
sum_salary = "select sum(e_salary) from emp_details;"
connection = db_connection("localhost","root","725@Mysql", "db2")

result = read_table(connection,sum_salary)
for res in result:
    print(res)

Database Connection Established
(Decimal('629000'),)

**AVG() - returns average values of a numeric column**

In [46]:
avg_salary = "select avg(e_salary) from emp_details;"
connection = db_connection("localhost","root","725@Mysql", "db2")

result = read_table(connection,avg_salary)
for res in result:
    print(res)

Database Connection Established
(Decimal('104833.3333'),)

In [47]:
avg_age = "select avg(e_age) from emp_details;"
connection = db_connection("localhost","root","725@Mysql", "db2")

result = read_table(connection,avg_age)
for res in result:
    print(res)

Database Connection Established
(Decimal('30.5000'),)

# String Functions

* **LTRIM() - Removes Blanks on Left side of the character expression**
* **LOWER() - Converts all characters into lower cases**
* **UPPER() - Converts all cjharacters into upper cases**
* **REVERSE() - Reverses all characters in the string**
* **SUBSTRING() - Gives Sub string from original using Slicing**

In [48]:
l_trim = "select '   Bipul ';"
#connection = db_connection("localhost","root","725@Mysql", "db2")

result = read_table(connection,l_trim)
for res in result:
    print(res)

('   Bipul ',)

In [49]:
l_trim = "select ltrim('   Bipul ');"
#connection = db_connection("localhost","root","725@Mysql", "db2")

result = read_table(connection,l_trim)
for res in result:
    print(res)

('Bipul ',)

In [50]:
l_case = "select lower('HELLO WORLD!!');"
#connection = db_connection("localhost","root","725@Mysql", "db2")

result = read_table(connection,l_case)
for res in result:
    print(res)

('hello world!!',)

In [51]:
u_case = "select upper('hello world!!');"
#connection = db_connection("localhost","root","725@Mysql", "db2")

result = read_table(connection,u_case)
for res in result:
    print(res)

('HELLO WORLD!!',)

In [52]:
r_string = "select reverse('hello world!!');"
#connection = db_connection("localhost","root","725@Mysql", "db2")

result = read_table(connection,r_string)
for res in result:
    print(res)

('!!dlrow olleh',)

In [53]:
sub_string = "select substring('Today it seems to be rain' , 22 , 4);"
#connection = db_connection("localhost","root","725@Mysql", "db2")

result = read_table(connection,sub_string)
for res in result:
    print(res)

('rain',)

# CASE statements - used to make mutiway decisions

In [54]:
case_queary = """
select *,
case
when e_salary < 90000 then 'C'
when e_salary < 120000 then 'B'
else 'A'
end as grade
from emp_details;"""

connection = db_connection("localhost","root","725@Mysql", "db2")

result = read_table(connection,case_queary)
for res in result:
    print(res)

Database Connection Established
(1, 'John', 95000, 45, 'Male', 'Operations', 'B')
(2, 'Jerry', 80000, 22, 'Male', 'Support', 'C')
(3, 'Anne', 120000, 25, 'Female', 'Analytics', 'A')
(4, 'Jerry', 72000, 30, 'Female', 'Analytics', 'C')
(5, 'Bipul', 150000, 33, 'Male', 'Sales', 'A')
(6, 'Samuel', 112000, 28, 'Male', 'Operations', 'B')

# IF() - It is an alternative to case statement

In [55]:
iif_query = """select e_id,e_name,e_age, IF(e_age>30,'Old employee','Young employee') 
as e_generation from emp_details"""

connection = db_connection("localhost","root","725@Mysql", "db2")

result = read_table(connection,iif_query)
for res in result:
    print(res)

Database Connection Established
(1, 'John', 45, 'Old employee')
(2, 'Jerry', 22, 'Young employee')
(3, 'Anne', 25, 'Young employee')
(4, 'Jerry', 30, 'Young employee')
(5, 'Bipul', 33, 'Old employee')
(6, 'Samuel', 28, 'Young employee')

# User Defined Function

* **Scaler valued**
* **Table valued**

**Scaler values will always returns scaler value**

In [57]:
que = "create function add_ten(num int) returns int DETERMINISTIC return (num+10);"
execute_query(connection,que)

Querry Executed

In [62]:
trig_function = "SELECT add_ten(3);"

connection = db_connection("localhost","root","725@Mysql","db2")

result = read_table(connection , trig_function)
for res in result:
    print(res)

Database Connection Established
(13,)

# Clauses in MySql - OrderBy, GroupBy, having

**ORDER BY- to sort data in asscending or descending order**

In [65]:
que = "select * from emp_details order by e_salary"

result = read_table(connection , que)
for res in result:
    print(res)

(4, 'Jerry', 72000, 30, 'Female', 'Analytics')
(2, 'Jerry', 80000, 22, 'Male', 'Support')
(1, 'John', 95000, 45, 'Male', 'Operations')
(6, 'Samuel', 112000, 28, 'Male', 'Operations')
(3, 'Anne', 120000, 25, 'Female', 'Analytics')
(5, 'Bipul', 150000, 33, 'Male', 'Sales')

In [66]:
que = "select * from emp_details order by e_salary DESC"

result = read_table(connection , que)
for res in result:
    print(res)

(5, 'Bipul', 150000, 33, 'Male', 'Sales')
(3, 'Anne', 120000, 25, 'Female', 'Analytics')
(6, 'Samuel', 112000, 28, 'Male', 'Operations')
(1, 'John', 95000, 45, 'Male', 'Operations')
(2, 'Jerry', 80000, 22, 'Male', 'Support')
(4, 'Jerry', 72000, 30, 'Female', 'Analytics')

**Top 3 rows**

In [68]:
#que = "select TOP 3 * from emp_details"
que = "select * from emp_details LIMIT 3"

result = read_table(connection , que)
for res in result:
    print(res)

(1, 'John', 95000, 45, 'Male', 'Operations')
(2, 'Jerry', 80000, 22, 'Male', 'Support')
(3, 'Anne', 120000, 25, 'Female', 'Analytics')

In [70]:
#que = "select TOP 3 * from emp_details order by e_age desc"
que = "select * from emp_details order by e_age LIMIT 3"

result = read_table(connection , que)
for res in result:
    print(res)

(2, 'Jerry', 80000, 22, 'Male', 'Support')
(3, 'Anne', 120000, 25, 'Female', 'Analytics')
(6, 'Samuel', 112000, 28, 'Male', 'Operations')

**Group By - used to get aggregate result with respect to a group**

In [71]:
que = "select avg(e_salary),e_gender from emp_details GROUP BY e_gender;"

result = read_table(connection , que)
for res in result:
    print(res)

(Decimal('109250.0000'), 'Male')
(Decimal('96000.0000'), 'Female')

In [72]:
que = "select avg(e_salary),e_dept from emp_details GROUP BY e_dept;"

result = read_table(connection , que)
for res in result:
    print(res)

(Decimal('103500.0000'), 'Operations')
(Decimal('80000.0000'), 'Support')
(Decimal('96000.0000'), 'Analytics')
(Decimal('150000.0000'), 'Sales')

In [73]:
que = "select avg(e_salary),e_dept from emp_details GROUP BY e_dept order by avg(e_age);"

result = read_table(connection , que)
for res in result:
    print(res)

(Decimal('80000.0000'), 'Support')
(Decimal('96000.0000'), 'Analytics')
(Decimal('150000.0000'), 'Sales')
(Decimal('103500.0000'), 'Operations')

In [74]:
que = "select avg(e_salary),e_dept from emp_details GROUP BY e_dept order by avg(e_age) desc;"

result = read_table(connection , que)
for res in result:
    print(res)

(Decimal('103500.0000'), 'Operations')
(Decimal('150000.0000'), 'Sales')
(Decimal('96000.0000'), 'Analytics')
(Decimal('80000.0000'), 'Support')

**Having clause - used with group by to impose conditions on groups**

In [75]:
que = "select e_dept, avg(e_salary) as avg_salary from emp_details group by e_dept having avg(e_salary) > 100000"

result = read_table(connection , que)
for res in result:
    print(res)

('Operations', Decimal('103500.0000'))
('Sales', Decimal('150000.0000'))

In [76]:
que = "select * from emp_details where e_salary > 100000"

result = read_table(connection , que)
for res in result:
    print(res)

(3, 'Anne', 120000, 25, 'Female', 'Analytics')
(5, 'Bipul', 150000, 33, 'Male', 'Sales')
(6, 'Samuel', 112000, 28, 'Male', 'Operations')

In [79]:
que = "select * from emp_details where e_gender = 'Male';"

result = read_table(connection , que)
for res in result:
    print(res)

(1, 'John', 95000, 45, 'Male', 'Operations')
(2, 'Jerry', 80000, 22, 'Male', 'Support')
(5, 'Bipul', 150000, 33, 'Male', 'Sales')
(6, 'Samuel', 112000, 28, 'Male', 'Operations')